package com.venom.mushroomsapi;


import com.venom.mushroomsapi.models.Mushroom;
import com.venom.mushroomsapi.repositories.base.GenericRepository;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;

import java.util.Arrays;
import java.util.List;

@SpringBootApplication
public class MushroomsapiApplication {

    @Autowired
    public MushroomsapiApplication(GenericRepository<Mushroom> superheroesRepository) {
        List<Mushroom> initialMushrooms = Arrays.asList(
                new Mushroom(1,"Обикновена манатарка", "Манатарка е род базидиеви гъби от семейство Манатаркови (Boletaceae) чиито членове се наричат манатарки. Някои видове от същото семейство, но от друг род също се наричат манатарки. Сред тях са различните видове масловки, брезовки и др. В горите на България са доста разпространени различните видове, и особено високо ценената обикновена манатарка. Гъбите от този род плододават сравнително едри, понякога огромни тела. Спорообразуващият слой на всеки вид е под формата на гъсти тръбички и се намира в долната част на гуглата която често е под формата на кръгла кифла. Пънчетата им обикновено са дебели особено в основата и са украсени с мрежести ивици или цветни точици.", "http://manatarka.org/files/2011/12/Boletusedulis3.jpg"),
                new Mushroom(2,"Алпийска чашка", "Алпийската чашка е гъба от семейство Sarcoscyphaceae. В България се среща във Витоша – край р. Владайска. Включена е в Червен списък на гъбите в България. Плодните тела (апотеции) излизащи по няколко от обща кореноподобна част, в младо състояние затворени, кълбовидни, по-късно отварящи се и тогава крушовидни, кубовидни или камбанковидни, 0,5–1,5 cm в диаметър, назъбени в горната си част, с яркочервен, вдлъбнат химений, месести, отвън мъхести, покрити с бели власинки, в долната си част преминаващи в тънка, влакнеста, белезникава дръжка, дълга до 2 cm и широка 1,5 mm. Спорите елипсовидни или удълженоелипсовидни, (35)40–45 × 12,5–15 μm, едноклетъчни, гладки, дебелостенни, с 2–4 мастни капки, безцветни. Плодни тела се образуват през X–IV.", "http://manatarka.org/files/2016/03/Microstomaprotractum1.jpg"),
                new Mushroom(3,"Виолетов вълчи зъб", "Вълчият зъб, още Патуйардова гъба(Inocybe erubescens), е силно отровна базидиева гъба от род Inocybe. В зависимост от оцветяването на шапката – бяло или бледовиолетово – са познати два вариетета на този вид. Белият вариетет е Inocybe geophylla var. geophylla, а бледовиолетовият е Inocybe geophylla var. lilacina. Расте в широколистни храсталаци и горски поляни от края на пролетта до края на лятото. Образува микориза с множество видове дървета и храсти. Широко разпространен вид.", "http://manatarka.org/files/2018/05/Inocybegeophylla7.jpg"),
                new Mushroom(4, "Гигантска пърхутка", "Гигантската пърхутка е гъба от семейство Agaricaceae (Печуркови). Плодното тяло с кълбовидна форма, бяло, понякога достига размери до 20 kg и до 80 cm в диаметър. Външната обвивка (екзоперидий) е гладка, бяла и се разпада на късове. Вътрешната обвивка (ендоперидий) също е бяла и гладка и постепенно покафенява. Дезинтегрира заедно с външната обвивка след узряване на спорите. Спороносния слой (месото или глеба) е бял, твърд, а при старите екземляри потъмнява и омеква. В основата на кълбото има мицелни нишки, чрез които плодното тяло се захваща за почвата. Плодното тяло на тази гъба се развива изключително бързо и понякога може да израсне за една нощ. Този рядко срещан вид расте поединично или на групи върху затревени места – в и извън горите. Сезон: пролет – лято (V-VI).", "http://manatarka.org/files/2012/05/Calvatiagigantea2c.jpg"),
                new Mushroom(5, "Червена мухоморка", "Червената мухоморка е гъба от семейство Amanitaceae (Мухоморкови). Тя е най-добре познатата гъба от детските илюстрации и фолклора. Смята се за силно отровна. Съдържа в себе си два алкалоида – мускарин и мускаридин, както и халюциногенното вещество буфотенин. От незапомнени времена мляко с натрошени вътре парченца червена мухоморка се използва за борба с мухи и насекоми. Симптомите на отравяне се проявяват сравнително бързо, след 1 до 4 часа, и са много различни за различните хора. Някои хора я консумират в известни количества, за да получат халюцинации – тази черта на червената мухоморка е известна още от ритуалите на сибирските и финландските шамани. Смята се, че сушените шапки съдържат от пет до десет пъти по-силен халюциноген от пресните.", "http://manatarka.org/files/2018/03/Amanitamuscaria35b.jpg"),
                new Mushroom(6, "Златист пачи крак", "Златистият пачи крак е гъба от семейство Cantharellaceae (Пачи крака). Среща се в планински иглолистни гори. Расте на големи групи върху почва или силно изгнила дървесина. Сезон – от средата на лятото до края на есента.", "http://manatarka.org/files/2014/09/Cantharellaceae2.jpg"),
                new Mushroom(7, "Дяволска гъба", "Дяволската гъба е гъба от семейство Boletaceae (Манатаркови). Среща се в топли широколистни гори върху варовикова почва. Образува микориза с дъбове (Quercus), бук (Fagus), кестен (Castanea), габър (Carpinus) или липа (Tilia). Широко разпространен вид в Европа, но рядко срещан. Много по-често се среща на юг, докато на север е много по-рядък и напълно отсъства в най-северните части.", "http://manatarka.org/files/2011/12/Boletussatanas6a.jpg"),
                new Mushroom(4, "Сиво-виолетова гълъбка", "Сиво-виолетовата гълъбка е гъба от семейство Russulaceae (Гълъбки). Шапката й е Отначало полукълбовидна, по-късно плоска и слабо вдлъбната в центъра. Виолетова, розово-виолетова, сиво-виолетова, тъмнозелена или оцветена с комбинация от тези цветове. Пънчето й е цилиндрично или понякога изтъняващо към основата. Бяло. Повърхността е гладка. Височина до 12 cm. Среща се в широколистни и иглолистни гори, в низини и планини. Расте поединично или на малки групи. Сезон – от края на пролетта до края на есента (V-XI). Широко разпространен и често срещан вид в цялата страна.", "http://manatarka.org/files/2017/12/Russulacyanoxantha1a.jpg")
        );
        initialMushrooms
            .forEach(superheroesRepository::add);
    }

    public static void main(String[] args) {
        SpringApplication.run(MushroomsapiApplication.class, args);
    }
}
